README.md

# Table of Contents

1.  [General Information](#orgba1ffa4)
    1.  [Color Palette](#org9c6e5f9)
2.  [Pages](#org1201699)
    1.  [Pages Overview](#org4e31904)
        1.  [General](#orgdba8a0f)
        2.  [Font](#org42f714a)
        3.  [Project structure](#orgd4b255c)


<a id="orgba1ffa4"></a>

# General Information


<a id="org9c6e5f9"></a>

## Color Palette

-   **css/replate.css** sets five color variables that should be used for
    all colors and background colors in the project.
-   **&#x2013;foreground-marginals: #4e2670** used for text in headers and footers
-   **&#x2013;foreground-main: rgb(10, 10, 10)** used for text in the content area
-   **&#x2013;background-marginals: #fceed1** used as the background in headers and footers
-   **&#x2013;background-main: white** used as the background in the content area
-   **&#x2013;hover: #7d3cff** used as the color for hover text


<a id="org1201699"></a>

# Pages


<a id="org4e31904"></a>

## Pages Overview


<a id="orgdba8a0f"></a>

### General

-   Four pages: Home Page, About, Donate, FAQ
-   **header.html** and **footer.html** are standard headers and footers and should be copied and pasted into all .html files.


<a id="org42f714a"></a>

### Font

The base font for the project is [Work Sans by Wei Huang](https://fonts.google.com/specimen/Work+Sans?preview.size=25&sidebar.open&selection.family=Work+Sans).


<a id="orgd4b255c"></a>

### Project structure

The following file structure is maintained by the project. Any
additional files or directories should be added to this section of
this document.

**/**

-   **about.html** About page
-   **index.html** Home page
-   **donate.html** Donate page
-   **faq.html** FAQ page
-   **footer.html** Template footer
-   **header.html** Template header
-   **README.md** This document exported to markdown
-   **assets/** Contains non-logo images used in the project
-   **css/** css files
    -   **replate.css** common css for all pages
    -   ***page-name*.css** css pages for each page
-   **DesignFiles/** contains documents related to the project's overall design
    -   **design-ideas.org** org-mode document with early design ideas,
        preserved for historical purposes.
    -   **DesignIdeas.pdf** compressed pdf exported from the above file
    -   **README.org** org-mode source document for this file
    -   **README.pdf** compressed PDF exported from this file
-   **logo images** contains all logos used in the project

